# EnergyAnalysisAdvancedOptions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisAdvancedOptions Property
ParameterTypeId Class See Also
---
"Other Options"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisAdvancedOptions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisAdvancedOptions As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisAdvancedOptions {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace